# FloorRecreateFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..FloorRecreateFailed Property
BuiltInFailures..::..MassFailures Class See Also
---
The floor cannot be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FloorRecreateFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorRecreateFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FloorRecreateFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace